quickstarts/rules-interview/src/test/resources/xml/soap-request-fail.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:switchyard-quickstart:rules-interview:0.1.0">
   <soapenv:Header/>
   <soapenv:Body>
      <urn:verify>
         <applicant>
            <age>16</age>
            <name>Sixteen</name>
         </applicant>
      </urn:verify>
   </soapenv:Body>
</soapenv:Envelope>